package ua.epam.maze.engine.generator;

public interface MazeFieldGenerator {
    /**
     * Герерує лабіринт на основі вже заданої матриці
     * @param field - масив початкових значень лабіринту, буде очищено і перезаписано новими значеннями
     * @return лабіринт у вигляді масиву 0 та 1, де 0 = відкрита локація, 1 - закрита локація
     *          Якщо метод повернув null - стався збій в роботі алгоритму
     */
    char[][] generate(char[][] field);

    /**
     * Герерує лабіринт на основі параметрів висоти та ширини
     * @param heigth - висота
     * @param wigth  - ширина
     * @return       - лабіринт у вигляді масиву 0 та 1, де 0 = відкрита локація, 1 - закрита локація
     *                 Якщо метод повернув null - стався збій в роботі алгоритму
     */
    char[][] generate(int heigth, int wigth);
}
