package ua.epam.maze.engine.finder;

import ua.epam.maze.Point;

public interface MazeWayFinder {
    /**
     * Шукає шлях між двома заданими локаціями в лабіринті
     *
     * @param field - поле лабіринта у вишляді 1 та 0, де 1 - закрита локація, 0 - відкрита локація
     * @param start - координати початкової локації
     * @param end   - координати кінцевої локації
     * @return - повертає масив з двох елементів, перший елемент - int steps - кількість кроків, які зробив алгоритм
     *                                            другий елемент - Stack<Point> - маршрут у вигляді стеку координат
     *                                            Якщо метод повернув null чи стек дорівнює null - значить відбувся збій в алгоритмі
     *                                            Якщо не існує маршруту - стек повинен тути довжини 0
     */
    Object[] getWay(char[][] field, Point start, Point end);
}
